language_cod = 'en test'
user_name = 'unknown'
languages = {
'start-text' : """سلام لطفا برای ادامه یک گزینه را انتخاب کنید. توجه داشته باشید که با انتخاب گزینه سوم، زبان پیش فرضی که برای نرم افزار تلگرام خود انتخاب کرده اید برای ربات هم انتخاب میشود.

Hello, please select one option to continue. Note that by choosing the third option, the default language you have selected for your Telegram app will also be chosen for the bot.""",
'en' : {
  'select-language': "You have selected the Persian language.",
  'select-default': "You have selected the default language.",
  'unknown-select-keyboard': "🔺An unknown option has been selected.🔺",
  'account': 'Manage Account 🔧',
  'setting': '⚙Settings',
  'tools': 'Tools🛠',
  'orders': 'Orders🛒',
  'back': 'Back⬅',
  'gift-card-request': 'Request gift cards for games and apps🎁💳',
  'gem-and-rewards-request': 'Request gems and rewards for games🏆💎',
  'seo-request': 'SEO Request for website📈',
  'website-design-request': 'Request website design👨‍💻',
  'bot-design-request': 'Request bot design🤖',
  'server-request': 'Server request🌐',
  'security-request': 'Security request🔒',
  'project-upload-channel': 'Submit project in the channel (Project Finder)📁',
  'account-request-channel': 'Submit and request account (Gaming Account Channel)📁',
  'welcome-send-text': f"""Hello dear {user_name}.

First of all, welcome to our all-in-one bot🎉

And secondly, we are happy for you to join the Zephus Union to use our tools⚙

🔺Now choose one of the options below to reach your goal""",
'orders-text': '🔺Please select the desired option🔺',
  'tools-text': '🔺Please select the desired option🔺',
  'setting-text': '@',
  'account-text': '@',
  'change-language': 'Change Language 🌐',
  '2fa': '2FA 🛡️',
  'clear-database': 'Clear data from the database 🗑️',
  'account-upgrade': 'Account upgrade🔝',
  'account-status-guide': 'Account Status Guide 📖',
  'recovery-account': 'Account recovery 🔄',
  'invitation-to-friends': 'Invite friends 🗣',
  'history-of-my-account': 'History of my account 📜',
  'wallet-recharge': 'Wallet recharge 💰',
  'management-and-growth-for-page-and-channel': '🗯Management and Growth for Page and Channel',
  'media-downloader': '📥Media Downloader',
  'file-format-converter': '♻️File Format Converter',
  'file-link-converter': '🔄File to Link Converter and vice versa',
  'file-quality-editor': '🛠File Quality Editor',
  'ip-network-tool': '🌐IP and Network Tools',
  'bypass-sanctions': '🚀Bypass Sanctions',
  'antivirus-antiscammer': '🔐Antivirus and Anti-scammer',
  'fact-checker': '📚Fact Checker (Content Verification)',
  'smart-music-finder': '🎶Smart Music Finder',
  'smart-feed-reader': '📡Smart Feed Reader',
  'smart-translator': '🌍Smart Translator',
  'live-stock-market': '📈Live Stock Market',
  'temporary-email-sms': '📬Temporary Email and SMS',
  'apply-assistant': '🎓Apply Assistant',
  'telegram-search': '🔍Telegram Search',
  'voice-text-converter': '🗣Voice and Text Converter',
  'movie-series-downloader': '🎬Movie and Series Downloader',
  'book-article-downloader': '📚Book and Article Downloader',
  'artificial-intelligence': '🤖Artificial Intelligence'
},
'fa' : {
'select-language' : "شما زبان فارسی را انتخاب کردید.",
'select-default' : 'شما زبان پیش‌فرض را انتخاب کردید.',
'unknown-select-keyboard' : "🔺گزینه ناشناسی انتخاب شده است.🔺",
'account' : 'مدیریت حساب کاربری 🔧',
'setting' : '⚙تنظیمات',
'tools' : 'ابزار ها🛠',
'orders' : 'سفارشات🛒',
'back' : 'بازگشت⬅',
'gift-card-request' : 'درخواست گیف کارت برای بازی و برنامه ها🎁💳',
'gem-and-rewards-request' : 'درخواست جم و جوایز برای بازی ها🏆💎',
'seo-request' : 'درخواست سئو سایت📈',
'website-design-request' : 'درخواست طراحی سایت👨‍💻',
'bot-design-request' : 'درخواست طراحی ربات🤖',
'server-request' : 'درخواست سرور🌐',
'security-request' : 'درخواست تامین امنیت🔒',
'project-upload-channel' : 'ارسال پروژه در کانال(پروژه یاب)📁',
'account-request-channel' : 'ارسال و درخواست اکانت(کانال اکانتی گیم)📁',
'welcome-send-text' : f"""سلام {user_name} عزیز.

اول از همه به ربات تقریبا همه کاره ما خوش اومدی🎉

و دوم اینکه خوشحالیم بابت پیوستن شما به اتحاد زیفوس برای استفاده از ابزارهای ما⚙

🔺حالا یکی از گزینه های زیر رو برای رسیدن به هدفت انتخاب کن""",
'orders-text' : '🔺لطفا گزینه مورد نظر را انتخاب کنید🔺',
'tools-text' : '🔺لطفا گزینه مورد نظر را انتخاب کنید🔺',
'setting-text' : 'null',
'account-text' : 'null',
'change-language' : 'تعویض زبان 🌐',
'change-language-text' : '''🔘لطفا زبان مورد نظر را انتخاب کنید.

[توجه داشته باشید که هر ماه تنها یکبار میتوانید زبان خود را تعویض کنید پس در انتخاب زبان دقت کنید]''',
'change-language-db-text' : f'''🟢زبان شما به {language_cod} تغییر کرد.''',
'2fa' : '2FA 🛡️',
'2fa-text' : '''✅ امنیت شما همیشه در اولویت ما هست.

🛡با فعال کردن احراز هویت دو مرحله‌ای، امنیت حساب خود را بیشتر کرده و از دسترسی افراد غیرمجاز به اطلاعات شخصی خود جلوگیری کنید.''',
'clear-database' : 'پاکسازی اطلاعات از پایگاه داده 🗑️',
'clear-database-yes' : '❌شرایط را خوانده و موافقت میکنم',
'clear-database-nope' : '✅شرایط را خوانده و مخالفم',
'clear-database-yes-end-project-dell' : 'null',
'clear-database-nope-end-project-back' : 'null',
'change-language-db-text' : 'null',
'change-language-db-text-yes' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◼️◼️◼️◼️◼️
''',
'change-language-db-text-yes2' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◽️◼️◼️◼️◼️
''',
'change-language-db-text-yes3' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◽️◽️◼️◼️◼️
''',
'change-language-db-text-yes4' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◽️◽️◽️◼️◼️
''',
'change-language-db-text-yes5' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◽️◽️◽️◽️◼️
''',
'change-language-db-text-yes6' : '''
✅اطلاعات شما در حال حذف از پایگاه داده ما است...
لطفا (چند ثانیه) منتظر بمانید تا پیغامی مبنی بر حذف را مشاهده کنید.

⛓نکته: با ارسال پیام جدید یا کلیک بر روی یکی از گزینه های ربات، مجدد شروع به دریافت اطلاعات و ثبت آنها میکنیم.

🔺در صورت موافقت ادامه دهید
در غیر این صورت چت را به طور کامل حذف کنید
◽️◽️◽️◽️◽️◽️
''',
'change-language-db-text-yes7' : '''✅اتمام پاکسازی، حذف با موفقیت انجام شد🟢
برای شروع مجدد روی گزینه ی زیر کلیک کنید.
/start''',
'clear-database-text' : '''⚠️ هشدار! ⚠️

⚠️شما درخواست حذف تمام طلاعات از پایگاه داده را دارید

⚠️در صورت موافقت تمامی اطلاعات ذخیره شده از جمله ((جوایز - مستندات- تاریخچه- اشتراکات)) و ((خرید های)) شما از پایگاه داده حذف شده و امکان دسترسی مجدد نخواهید داشت و از این پس شما کاربر جدید محسوب میشود!

❌با این شرایط موافقت میکنید؟''',
'account-upgrade' : 'ارتقاء حساب🔝',
'account-upgrade-text' : '''[کنترل کامل ابزارهای حرفه‌ای را در دست بگیر]
تمامی امکانات منحصر به فرد زیفوس با ارتقاء حسابت در اختیارته🚀
با کدوم پلن میخوای شروع کنی؟''',
'activate-with-user-name-and-password' : '🔐فعال سازی با نام کاربری و رمز عبور',
'activate-with-user-name-and-password-text' : 'امتن ارسال یوز نیم',
'active-by-user-password-text-send-password' : 'متن ارسال رمز عبور',
'active-by-user-password-text-end-verify' : 'متن اعلام پایان عملیات',
'activate-with-phone' : '📱فعال سازی با شماره تلفن',
'activate-with-phone-text' : 'ارتقاء حساب🔝',
'activate-with-email-and-password' : '📩فعال سازی با ایمیل و رمز عبور',
'a-written-text-for-requesting-to-send-an-email' : '''
📨لطفا آدرس ایمیل معتبر خود را وارد کنید.

🔺نکته:
تنها آدرس های مورد پذیرش ما،
آدرس هایی هستند که به (gmail.com@) ختم میشوند. 
برای نمونه:
Yourname@gmail.com

🔺توجه: (بعد از انجام عملیات کد فعال سازی به ایمیل شما ارسال میشود آن را ارسال کرده و چند ثانیه منتظر بماند)
''',
'the-written-text-for-an-incorrect-email' : '⚠️آدرس ایمیلی که وارد کردید نامعتبر است. لطفا دوباره آن را وارد کنید.',
'written-text-for-unsafe-characters' : '''🔴خطای: x60
⚠️ !!توجه!! ⚠️
🔺رمز عبور شما حاوی کاراکتر های غیر مجاز و خارج از لیست پذیرش ما هستند.
🔺لطف در هنگام استفاده ازکاراکتر ها به لیست مورد پذیرش ما دقت کنید.''',
'text-for-password-length' : '''🔴خطای: x30
⚠️ !!توجه!! ⚠️
🔺طول کاراکتر ارسالی شما بیشتر یا کمتر از حد استاندارد است.
🔺لطف در نوشتار طول رمز عبور دقت کنید که برابر با 12 عدد باشد.''',
'text-announcement-to-declare-the-end-of-the-request-for-email-and-password-operations' : '''🟢اطلاعات شما با موفقیت تکمیل شده و ثبت نام انجام شد.
🔺برای استفاده از ربات بر روی دکمه (برگشت) کلیک کنید.''',
'written-text-for-a-password-request' : '''
🔓لطفا رمز خود را وارد کنید.

🔺نکته:
حتما از از حروف بزرگ و کوچک استفاده و علائم نگارشی در رمز‌ خود استفاده کنید تا رمز‌ قوی تری برای محافظ از خود بسازید.

🔺نکته دوم:
تعداد کاراکترهای مورد قبولی برای رمز عبور (12) عدد میباشد. بالا یا پایین بودن آن موجب اعلام  خطا میشود.

🔺نکته سوم:
موارد نگارشی قابل استفاده در رمز فقط موارد زیر هستند.
(? ! @ $ *)(0-9)(a-z)(A-Z)

🔺توجه: (بعد از انجام عملیات کد فعال سازی به ایمیل شما ارسال میشود آن را ارسال کرده و چند ثانیه منتظر بماند)
''',
'account-status-guide' : 'راهنمای (وضعیت‌ اکانت) 📖',
'account-status-guide-text' : '''🔎نگاهی به فعالیت خود داشته باشید

⛓(شما درخواست دریافت تاریخچه فعالیت خود را دارید توجه داشته باید که این اطلاعات محرمانه بوده و فقط خودتان امکان بازدید و بازیابی را دارید)

⚙[درخواست شما ممکن است کمی طول بکشد پس صبور باشید]

⛓اینجا می‌تونی تاریخچه کامل فعالیت‌های خودت رو ببینی.''',
'recovery-account' : 'بازیابی اکانت 🔄',
'recovery-account-text' : '''نگران نباش!
اگر مشکلی برای حسابت پیش اومده، من اینجام تا کمکت کنم. با چند قدم ساده، همه چیز رو به حالت قبل برمی‌گردونیم. 🛡🔒👨‍💻''',
'invitation-to-friends' : 'دعوت از دوستان 🗣',
'invitation-to-friends-text' : '''مارو به دوستاتت معرفی کن و با
هر دعوت، 5 ستاره هم از ما هدیه بگیر😍⭐️

🔺درسته با ستارهات میتونی خیلی از پلن هارو خرید یا شارژ کنی اما صبر کن تنها اینا نیست!

3 تا جایزه دیگه رو هنوز نگرفتی!!؟

هدیه های بعدی با دعوت هر (20 و 50 و 100) نفر برات باز میشه🎉''',
'xxx' : 'del status',
'deleted-keyboard-send-phone' : '@',
'xx' : '@',
'activate-with-phone-text-button-nope' : 'خیر ادامه نمیدم',
'history-of-my-account' : 'تاریخچه‌ اکانت من 📜',
'history-of-my-account-text' : 'null',
'wallet-recharge' : 'شارژ کیف پول 💰',
'wallet-recharge-text' : 'null',
'management-and-growth-for-page-and-channel': '🗯مدیریت و رشدِ پیج و کانال',
'media-downloader': '📥دانلودر چند رسانه ای',
'file-format-converter': '♻️تبدیل‌گر فرمت فایل‌ها',
'file-link-converter': '🔄تبدیل کننده فایل به لینک و بالعکس',
'file-quality-editor': '🛠ویرایشگر کیفیت فایل',
'ip-network-tool': '🌐ابزار IP و شبکه',
'bypass-sanctions': '🚀دور زدن تحریم‌ها',
'antivirus-antiscammer': '🔐آنتی ویروس و آنتی اسکمر',
'fact-checker': '📚فکت چکر (صحت سنجی محتوا)',
'smart-music-finder': '🎶موزیک یاب هوشمند',
'smart-feed-reader': '📡فید خوان هوشمند',
'smart-translator': '🌍مترجم هوشمند',
'live-stock-market': '📈بازار لحظه ای',
'temporary-email-sms': '📬ایمیل و پیام‌ساز موقت',
'apply-assistant': '🎓اپلای یار',
'telegram-search': '🔍جستجو در تلگرام',
'voice-text-converter': '🗣تبدیل‌گر گفتار و نوشتار',
'movie-series-downloader': '🎬دانلودر فیلم و سریال',
'book-article-downloader': '📚دانلود کتاب و مقالات',
'artificial-intelligence': '🤖هوش مصنوعی',
}
}
